[M_Aster_PlotMission04 MissionDefinition]
MissionDescription="When the entrance to the mine opens, nothing stands between it and the Witch's Tower, where the kidnapped Queen awaits rescue.."
MissionSummary="Enter the wizard's tower."

[M_Aster_PlotMission04:Defeatdragonset MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat the witch doctor."
MissionDescriptionOverride="When the entrance to the mine opens, nothing stands between it and the Witch's Tower, where the kidnapped Queen awaits rescue..<br><br>Seeing your approach, the Handsome Sorcerer has unleashed his pet dragon. You must defeat the dragon to gain entrance to the tower."

[M_Aster_PlotMission04:DefeatSorcerDaughter MissionObjectiveDefinition]
ProgressMessage="Amiri is a circus performer"

[M_Aster_PlotMission04:DefeatSorcererDaughterSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Defeat the doctor's daughter."
MissionDescriptionOverride="You are in a beautiful magical well; If you can't escape and reach the witch's house, you can't save the princess!<br><br>You are looking for a missing prisoner who can help you escape But the truth is that the persecuted witch's daughter has been captured and she wants to kill you. <br><br>It is better to kill him and escape from prison."

[M_Aster_PlotMission04:EnterSorcerersCastleSet2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="If you hold my door open, the thief queen will not wait between you and the magic guard.."

[M_Aster_PlotMission04:EscapeTheDungeon MissionObjectiveDefinition]
ProgressMessage="Avoid the sword"

[M_Aster_PlotMission04:ExitMines MissionObjectiveDefinition]
ProgressMessage="Leave the patient"

[M_Aster_PlotMission04:FeedButtstallionSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="He took the pot Queen Stallion, but needed food and brought him back to the magical land. It's good to try."

[M_Aster_PlotMission04:FindThePrisonerSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="You are trapped in a beautiful and magical cave. If you can't escape the witch's spell, you can't save the queen.!<br><br>Fortunately, he hears the mysterious voice of a prisoner somewhere in the prison. When you see this, you know to run.!"

[M_Aster_PlotMission04:FreeTheQueenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Save the princess."
MissionDescriptionOverride="You must save the queen before the dead magical knight kills her! "

[M_Aster_PlotMission04:UseTeleporterSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="A beautiful witch is waiting for you in her castle. You must find, kill and rescue the queen.!"
